Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E13D.tmx
Source language: en_us
Languages: zh_cn

source: Walkers' wild mushroom, bacon & barley broth
zh_cn: 野菇熏肉薏米浓汤——冬日暖心头

source: This is the perfect welcome-home warmer after a cold country walk, simply add some crusty bread
zh_cn: 步行乡间路，面包薏米汤。家有浓浓热，温暖上心头。

source: Ingredients
zh_cn: 食材：

source: Serves 6
zh_cn: 6人份

source: 200 g pack bacon lardons or rashers
zh_cn: 包装肥腊肉片或熏肉薄片 200克

source: 2 onions
zh_cn: 洋葱 2个

source: 4 medium carrots
zh_cn: 中型胡萝卜4根

source: 3 celery sticks
zh_cn: 芹菜杆 3根

source: 2 garlic cloves, crushed
zh_cn: 大蒜瓣 2个，压碎

source: 1 sprig rosemary and thyme
zh_cn: 迷迭香和百里香枝 1根

source: 30 g pack dried porcini or dried mixed wild mushrooms
zh_cn: 包装干牛肝菌或干混合野蘑菇 30克

source: 1 glass white wine
zh_cn: 白葡萄酒 一杯

source: 1 1/2 l chicken stock
zh_cn: 鸡高汤 1 1/2 升

source: 175 g pearl barley , well rinsed
zh_cn: 薏米 175克，洗好

source: 1 small head spring greens or chunk of Savoy cabbage
zh_cn: 小青菜或大块包菜 1颗

source: Parmesan or any strong hard cheese, grated, to serve
zh_cn: 帕尔玛干酪或或其他味道重的硬质奶酪，磨碎，备用

source: Method
zh_cn: 制作方法

source: Put a large saucepan over a medium heat.
zh_cn: 取一只大炖锅，中火加热。

source: Sizzle the lardons or bacon for 10 mins until golden, stirring now and then.
zh_cn: 将肥腊肉片或熏肉薄片不停煎炒，约10分钟煎至金黄即可。

source: While they cook, chop the onions, carrots and celery into smallish pieces.
zh_cn: 期间，将洋葱、胡萝卜和芹菜切成小块。

source: When the bacon is ready, stir in the veg, garlic and herbs, cover and gently cook for 10 mins.
zh_cn: 熏肉煎好后，与蔬菜，大蒜和香菜混合拌匀，盖上盖子，小火煮10分钟。

source: Meanwhile, put the mushrooms into a jug, then fill up to the 600ml mark with boiling water.
zh_cn: 同时，将蘑菇放入水壶，倒入600毫升开水。

source: Leave to soak for 10 mins.
zh_cn: 泡10分钟。

source: Lift the mushrooms out of their juice with a slotted spoon and roughly chop.
zh_cn: 用漏勺将蘑菇捞出，剁碎。

source: Turn up the heat under the pan, add the mushrooms, fry for 1 min, then pour in the wine.
zh_cn: 加热平底锅，放入蘑菇，煎1分钟，然后倒入红酒。

source: Let it evaporate right down, then pour the liquid from the mushroom jug into the pan, avoiding the last drops, as they can be gritty.
zh_cn: 待红酒蒸发后，将浸泡蘑菇的水倒入锅中，注意不要将水壶底层的沙粒倒进锅。

source: Add the stock and barley.
zh_cn: 加入高汤和薏米。

source: Simmer for 40 mins until the barley is tender.
zh_cn: 炖40分钟至薏米变软。

source: Lift out the thyme and rosemary stalks.
zh_cn: 捞出迷迭香和百里香枝。

source: Can be made up to 2 days ahead or frozen for up to 1 month.
zh_cn: 可以提前2天制作或者冻上1个月。

source: If you make ahead, the soup will need loosening with a little more stock as the barley will thicken it over time.
zh_cn: 如果提前准备，你需要加多一点高汤稀释薏米汤因为时间一长薏米会使汤便稠。

source: When ready to serve, finely shred the greens and simmer in the soup for 5 mins until tender.
zh_cn: 起锅前，将蔬菜切成条状，放入汤中炖5分钟直到变软。

source: Season to taste, then serve with cheese for sprinkling over the top, crusty bread and buttter.
zh_cn: 调味后尝一尝，撒些干酪，碎皮面包和黄油。

source: Nutrition per serving
zh_cn: 营养成分

source: 290 kcalories, protein 18.0g, carbohydrate 35.0g, fat 9.0g, saturated fat 3.0g, fibre 5.0g, salt 1.75g.
zh_cn: 卡路里 290克，蛋白质 18.0克，碳水化合物 35.0克，脂肪 9.0克，饱和脂肪酸 3.0克，纤维 5.0克，食盐 1.75克
